{"class_name": "Functional", "config": {"name": "model_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "MaskedTokenAndPositionEmbedding", "config": {"name": "masked_token_and_position_embedding_1", "trainable": true, "dtype": "float32", "maxlen": 6, "vocab_size": 30, "embed_dim": 300}, "name": "masked_token_and_position_embedding_1", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 300], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "MaskedTransformerBlock", "config": {"name": "masked_transformer_block", "trainable": true, "dtype": "float32", "num_heads": 4, "embed_dim": 300, "ff_dim": 32, "rate": 0.1}, "name": "masked_transformer_block", "inbound_nodes": [[["masked_token_and_position_embedding_1", 0, 0, {}], ["input_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 30, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["masked_transformer_block", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "output_layers": [["dense_4", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}