{"class_name": "Functional", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "MaskedTokenAndPositionEmbedding", "config": {"name": "masked_token_and_position_embedding", "trainable": true, "dtype": "float32", "maxlen": 6, "vocab_size": 30, "embed_dim": 300}, "name": "masked_token_and_position_embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TransformerBlock", "config": {"name": "transformer_block", "trainable": true, "dtype": "float32", "num_heads": 4, "embed_dim": 300, "ff_dim": 32, "rate": 0.1}, "name": "transformer_block", "inbound_nodes": [[["masked_token_and_position_embedding", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["transformer_block", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}